---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.CalculationLevel
source: html/76631989-d84f-3954-8743-f42b58ba4f43.htm
---
# Autodesk.Revit.DB.MEPSystemType.CalculationLevel Property

Identifies the calculation level for the system type.

## Syntax (C#)
```csharp
public SystemCalculationLevel CalculationLevel { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration